Autodesk.Revit.DB.NumberingSchema.AssignElementsToSequence(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId},System.String)
Assigns the input elements to a sequence identified by the given partition name.
Remarks:
Elements will be added to the sequence by changing the value of their
Partition parameter. The difference between this method and changing the
parameter value explicitly is that the method here causes sequences to get assigned
and renumbered automatically and immediately without needing to commit a transaction first.
A numbering sequence for the given partition does not need to exist yet;
it will get created automatically by this method as needed.
The elements' numbers are likely to be affected by this operation, which is to be
expected. The values of assigned numbers will depend on whether the given sequence
already exists or not. In both cases the elements will get renumbered in order of their
original creation, but the first value will be 1 if the sequence does not exist yet,
respectively the next highest number if the sequence does exist already. The general
matching policy is always applied causing matched elements to have the same number.
A special case is considered when the given elements are all the elements
of one sequence and are being assigned to a sequence that does not exist yet.
Such an operation is identical in effect to the MoveSequence
method and all the elements will keep their numbers unchanged.
elementIds:
Ids of elements which are to be added to a sequence.
All elements must be valid and belonging to this schema.
partitionName:
Name of the target sequence's partition
Throws Autodesk.Revit.Exceptions.ArgumentException:
the given partitionName cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
-or-
Thrown when elementIds contains Ids that are either invalid or of elements not from this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MergeSequences(System.Collections.Generic.IList`1{System.String},System.String)
Merges all elements from given numbering sequences to a new sequence.
Remarks:
Upon a successful merge, all elements in the new merged sequence
will be renumbered in order of the element creation. There will be no gaps.
There must not be a sequence for the target partition in the schema yet,
otherwise an exception will be thrown.
This operation modifies the Partition parameter of all elements
in the sequences that are being merged. Therefore, all its elements
must be accessible for editing, otherwise this operation will fail.
sourcePartitions:
A collection of partition names identifying the sequences to be merged together.
There must be at least two names in the list. All the sequences must exist already.
newPartition:
Name of a new partition into which the source sequences will be merged.
Leading and trailing white space is ignored in the given string and will be removed automatically.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sourcePartitions list must contain at least two names.
-or-
Either one or more sequences in the sourcePartitions list does
not exist in the schema, or the list contains duplicated names.
-or-
The sequence newPartition does already exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015